module.exports.SPORT_TYPES = [
  "⚽️",
  "🏀",
  "🏐",
  "🎮"
];

module.exports.SPOT_STATUS = {
  "OPEN": "OPEN",
  "CLOSED": "CLOSED",
  "WAIT_GROUP": "WAIT_GROUP"
};

module.exports.NOTIFY_STATUS = {
  "NOTIFIED_ONE_DAY_BEFORE": "NOTIFIED_ONE_DAY_BEFORE",
  "NOTIFIED_TWO_HOUR_BEFORE": "NOTIFIED_TWO_HOUR_BEFORE",
  "NOT_YET_NOTIFIED": "NOT_YET_NOTIFIED"
};

module.exports.SPB_METRO_TREES = ["❤️", "💛", "💚", "💙", "💜"];

module.exports.SPB_METRO_STATIONS_BY_TREE = {
  "❤️": [
    "Девяткино",
    "Гражданский проспект",
    "Академическая",
    "Политехническая",
    "Площадь мужества",
    "Лесная",
    "Выборгская",
    "Площадь Ленина",
    "Чернышевская",
    "Площадь восстания",
    "Маяковская",
    "Владимирская",
    "Пушкинская",
    "Технологический институт 1",
    "Балтийская",
    "Нарвская",
    "Кировский завод",
    "Автово",
    "Ленинский проспект",
    "Проспект ветеранов"
  ],
  "💛": [
    "Спасская",
    "Достоевская",
    "Лиговский проспект",
    "Площадь Александра Невского 2",
    "Новочеркасская",
    "Ладожская",
    "Проспект Большевиков",
    "Улица Дыбенко"
  ],
  "💚": [
    "Приморская",
    "Василеостровская",
    "Гостиный двор",
    "Маяковская",
    "Площадь Александра Невского 1",
    "Елизаровская",
    "Ломоносовская",
    "Пролетарская",
    "Обухово",
    "Рыбацкое"
  ],
  "💙": [
    "Парнас",
    "Проспект просвещения",
    "Озерки",
    "Удельная",
    "Пионерская",
    "Черная речка",
    "Петроградская",
    "Горьковская",
    "Невский проспект",
    "Гостиный двор",
    "Сенная площадь",
    "Технологический институт 2",
    "Фрунзенская",
    "Московский ворота",
    "Электросила",
    "Парк Победы",
    "Московская",
    "Звездная",
    "Купчино"
  ],
  "💜": [
    "Комендантский проспект",
    "Старая деревня",
    "Крестовский остров",
    "Чкаловская",
    "Спортивная",
    "Адмиралтейская",
    "Садовая",
    "Звенигородская",
    "Обводный канал 1",
    "Волковская",
    "Бухаресткая",
    "Международная"
  ]
};
